/*****************************************************************************/
/* Copyright (C), 2019, DIAS Automotive Electronic Systems Co; Ltd.          */
/* File Name:    types.h                                                  */
/* Description:  Common header for types and type manipulation               */
/*               macros for all source file of the bootloader                */
/*                                                                           */
/* Others:       other description                                           */
/*                                                                           */
/* Processor:    RH850F1L                                                    */
/* Compiler:     GHS_201517                                                  */
/********************************** 修改历史 *********************************/
/* Date            Version       Author      Description                     */
/* 2019-07-05   V11.01.01.00     陈惠            基线创建                          */
/*****************************************************************************/

#ifndef __LL_CAN_H
#define __LL_CAN_H

/*---------------------------------------------------------------------------*/
/* 头文件                                                                    */
/*---------------------------------------------------------------------------*/
#include "type.h"
#include "spp_generated.h"


/*---------------------------------------------------------------------------*/
/* 类型定义                                                                  */
/*---------------------------------------------------------------------------*/
typedef enum
{  
    Discard,
    Functional,
    Physical
} AddressType_e;

typedef struct
{
    UINT8 u8Data[8];
    AddressType_e eAtyp;
} Frame_t;

typedef struct
{
    Frame_t tFrame;
    bool bReceived;
}RxBuff_t;

/*---------------------------------------------------------------------------*/
/* 宏定义                                                                    */
/*---------------------------------------------------------------------------*/


/*---------------------------------------------------------------------------*/
/* 常量定义                                                                  */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* 变量定义                                                                  */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* 外部公开变量申明                                                              */
/*---------------------------------------------------------------------------*/
extern UINT8 gu8CanRevFlag;
extern UINT8 gu8FotaFlag;


/*---------------------------------------------------------------------------*/
/* 内部函数声明                                                              */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* 外部公开函数声明                                                          */
/*---------------------------------------------------------------------------*/
extern void ApiLlRx(RxBuff_t* ptRxBuffer);
extern bool ApilLlTx(const UINT8* pu8TxBufferData);
extern bool ApilLlIsTxEmpty(void);
extern void ApilLlFblFotaComMsgCb(UINT8 u8EventId, DcpdPackageFBLCom_t* ptData);
extern void ApilLlFblFotaOtherEcuCb(UINT8 u8EventId, UINT8* ptData, UINT32 u32DataLen);


#endif  /*CAN_H*/
