/*****************************************************************************/
/* Copyright (C), 2019, DIAS Automotive Electronic Systems Co; Ltd.          */
/* File Name:    dl_dataid.h                                                 */
/* Description:  Header for Data Identifier handling implementation          */
/*                                                                           */
/* Others:       other description                                           */
/*                                                                           */
/* Processor:    RH850F1L                                                    */
/* Compiler:     GHS_201517                                                  */
/********************************** 修改历史 *********************************/
/* Date            Version       Author      Description                     */
/* 2019-07-05   V11.01.01.00     陈惠            基线创建                          */
/*****************************************************************************/

#ifndef DL_DATAID_H
#define DL_DATAID_H

/*---------------------------------------------------------------------------*/
/* 头文件                                                                    */
/*---------------------------------------------------------------------------*/
#include "type.h"
#include "bl_mem.h"

/*---------------------------------------------------------------------------*/
/* 类型定义                                                                  */
/*---------------------------------------------------------------------------*/
typedef enum 
{
    read_only=0,            /* cannot write this DID */
    ext_sec_level=1,        /* application can write DID, BL can not */
    prog_sec_level=2,       /* BL can write DID any time */
    write_once=3,           /* BL can write DID once, pre_wr_act() enables write */
    write_once_after_prog=4,/* write-once after each re-programming */
    writability_mask=0xF    /* only lowest 4 bit used */
}WritabilityType_e;

typedef const struct
{
    UINT16 u16Did;
    MemType_e  eMemtype;
    UINT32 u32Address;
    UINT8  u8Size;
    bool   bReadability;
    UINT8  u8Writability; /* not WritabilityType_e, because it contains flags too */
}DidProp_t;

typedef const struct
{
    UINT8     u8Size;
    DidProp_t* ptId;
} Id_t;


/*---------------------------------------------------------------------------*/
/* 宏定义                                                                    */
/*---------------------------------------------------------------------------*/


/*---------------------------------------------------------------------------*/
/* 常量定义                                                                  */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* 变量定义                                                                  */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* 外部公开变量申明                                                              */
/*---------------------------------------------------------------------------*/

/* LC config structures */
extern Id_t tStdIdStr;
extern Id_t tCsrId;


/*---------------------------------------------------------------------------*/
/* 内部函数声明                                                              */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* 外部公开函数声明                                                          */
/*---------------------------------------------------------------------------*/


#endif /* DL_DATAID_H */
