/******************************************************************************/
/* Copyright (C), 2019, DIAS Automotive Electronic Systems Co; Ltd.		      */
/* File Name:	  dl_tp.c													  */
/* Description:  Tester Present service implementation       			      */
/* Others: 	  other description 										      */
/* 																		      */
/* Processor:	  RH850F1L													  */
/* Compiler:	  GHS_201517												  */
/********************************** 修改历史 **********************************/
/* Date			Version 	  Author	  Description					      */
/* 2019-07-05	 V11.01.01.00	  陈惠		基线创建							  */
/******************************************************************************/
 
/*---------------------------------------------------------------------------*/
/* 头文件																	     */
/*---------------------------------------------------------------------------*/
#include "dl_engine.h"
#include "dl_service.h"
#include "bl_timer.h"

/*---------------------------------------------------------------------------*/
/* 类型定义                                                                  */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* 宏定义                                                                    */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* 常量定义                                                                  */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* 变量定义                                                                  */
/*---------------------------------------------------------------------------*/


/*---------------------------------------------------------------------------*/
/* 外部参照变量                                                              */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* 内部函数声明                                                              */
/*---------------------------------------------------------------------------*/


/*---------------------------------------------------------------------------*/
/* 外部函数定义                                                              */
/*---------------------------------------------------------------------------*/
/******************************************************************************
*  function name | ApiDlTesterPresent
*  content       | It is the main command handler to handle TesterPresent.
*  parameter     | crcType:是否发送crc
*  return        | void
*  notice        | 无
******************************************************************************/
void ApiDlTesterPresent(const UINT8 *pu8Data)
{
    UINT8 *pu8Response;
    /* abort all operations and do actions or return without action */
    if (ApiDlAbortPendingOperations(ALL) == false)
    {
        /*do nothing -return */
    }
    else
    {
        if((pu8Data[0] & SubFunctionMask) != 0u)
        {
            /* invalid SubFunction */
            /* Send response always restarts S3 timer */
            (void)ApiDlSendNegativeResponse((UINT16)subFunctionNotSupported);
        }
        else
        {
            if(((pu8Data[0] & ResRequiredMask)== 0u))
            {
                /* positive response */
                pu8Response = ApiDlGetResponseBuffer();
                pu8Response[0] = pu8Data[0];
                /* Send response always restarts S3 timer */
                (void)ApiDlSendPositiveResponse(pu8Response,1);
            }
            else
            {
                ApiResetTimer(S3_timer_handle);
            }
        }
    }
}
