/*****************************************************************************/
/* Copyright (C), 2020, DIAS Automotive Electronic Systems Co; Ltd.          */
/* File Name:    ecu_iod_lte_ag35cen.h                                       */
/* Author:      付恒    Version: 01.01    Date: 2019-11-01                     */
/* Description:  AG35模组的中间件                                                  */
/*                                                                           */
/* Others:       other description                                           */
/*                                                                           */
/* Processor:    RH850F1L                                                    */
/* Compiler:     GHS                                                         */
/********************************** 修改历史 *********************************/
/* Date         Version          Author        Description                   */
/* 2020-09-24   V31.03.02.01.01  付恒            新建基线版本                        */
/*****************************************************************************/
#ifndef ECU_IOD_LTE_AG35CEN_H_
#define ECU_IOD_LTE_AG35CEN_H_

/*---------------------------------------------------------------------------*/
/*头文件                                                                        */
/*---------------------------------------------------------------------------*/
#include "type.h"

/*---------------------------------------------------------------------------*/
/*宏定义                                                                        */
/*---------------------------------------------------------------------------*/

/*-----AG35输出的方波的电压检测范围定义-----*/
#define LTE_PWM_PULSE_HIGH_MAX                      3600U /*单位为mv*/
#define LTE_PWM_PULSE_HIGH_MIN                      1080U
#define LTE_PWM_PULSE_LOW_MAX                       720U  /*电压可能存在负数，因此不定义最小值*/

/*-----GPS天线的电压检测范围定义-----*/
#define GNSSANT_VOL_NORMAL_MAX                      3600U /*单位为mv*/
#define GNSSANT_VOL_NORMAL_MIN                      3000U
#define GNSSANT_VOL_OPEN_MAX                        2800U
#define GNSSANT_VOL_OPEN_MIN                        2200U
#define GNSSANT_VOL_SHORT_TO_GND_MAX                300U  /*电压可能存在负数，因此不定义最小值*/

/*---------------------------------------------------------------------------*/
/*类型定义                                                                       */
/*---------------------------------------------------------------------------*/

/*-----AG35输出的方波的状态定义-----*/
typedef enum
{
    LTE_PWM_ST_PULSE_HIGH = 0U, /*方波中的高电平*/
    LTE_PWM_ST_PULSE_MIDDLE,    /*方波的中间态*/
    LTE_PWM_ST_PULSE_LOW,       /*方波中的低电平*/
    LTE_PWM_ST_PULSE_END
}LtePwmState_e;

/*-----GPS天线的状态定义-----*/
typedef enum
{
    GNSS_ANT_ST_NORMAL = 0U,    /*正常*/
    GNSS_ANT_ST_MIDDLE1,
    GNSS_ANT_ST_OPEN,           /*开路*/
    GNSS_ANT_ST_MIDDLE2,
    GNSS_ANT_ST_SHORT_TO_GND,   /*对地短路*/
    GNSS_ANT_ST_END
}GnssAntState_e;

/*---------------------------------------------------------------------------*/
/*外部公开变量                                                                     */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/*参数定义                                                                       */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/*枚举变量定义                                                                     */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/*外部公开函数声明                                                                   */
/*---------------------------------------------------------------------------*/

/******************************************************************************
*  function name | ApiLteInit
*  content       | AG35中间件初始化
*  parameter     | 无
*  return        | 无
*  notice        | 
******************************************************************************/
extern void ApiLteInit(void);

/******************************************************************************
*  function name | ApiLteGetPwmSt
*  content       | 查询模组的PWM方波状态
*  parameter     | 无
*  return        | LtePwmState_e:方波当前状态
*  notice        | 
******************************************************************************/
extern LtePwmState_e ApiLteGetPwmSt(void);

/******************************************************************************
*  function name | ApiLteGetGnssAntSt
*  content       | 查询GnssAnt状态
*  parameter     | 无
*  return        | GnssAntState_e:天线当前状态
*  notice        | 
******************************************************************************/
extern GnssAntState_e ApiLteGetGnssAntSt(void);

#endif
